[{"comment_ID": "l105ka2", "comment_Body": "I've worked as a data engineer for 5+ years. Nobody gives a shit about normalization- it's all about balancing minimizing joins while making sure your table doesn't become too big", "comment_Score": 1, "comment_Author": "CorerMaximus", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 05:17:12+00:00"}, {"comment_ID": "l104z4w", "comment_Body": "Not considered data engineering? My whole career so far is about denormalizing. I haven´t build any data model  that is 3NF or above (star modeling, data vault). I have clients still working on mainframes you can´t even consider relational", "comment_Score": 1, "comment_Author": "dehaema", "comment_Link_id": "t3_1cb573f", "Create Date": "2024-04-24 05:11:28+00:00"}, {"comment_ID": "l104eht", "comment_Body": "dm'ed", "comment_Score": 1, "comment_Author": "Shoddy-Avocado-6149", "comment_Link_id": "t3_1cahwty", "Create Date": "2024-04-24 05:05:54+00:00"}, {"comment_ID": "l104cme", "comment_Body": "I feel you. I had the same thing happen to me two weeks ago. Been doing 1-2 data lemur questions a day while timing myself Not so much to practice SQL, but to practice assessment taking.", "comment_Score": 1, "comment_Author": "DMReader", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 05:05:24+00:00"}, {"comment_ID": "l1046fi", "comment_Body": "You could have two tables, based on customer id and vehicle id so you don’t have to copy all of that information and if a customers phone number changes it’s easy to change a single row in another table which will have a primary key of the customer id", "comment_Score": 1, "comment_Author": "MulhollandDr1ve", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 05:03:45+00:00"}, {"comment_ID": "l103nop", "comment_Body": "I feel Elastic Search is limited as data is stored as an index. As result I need to perform 'search' for further analysis of the data. This is the reason I feel it is better to store the data and then retrieve the same for Elastic Search and also for data analysis. Is my understanding right ?", "comment_Score": 1, "comment_Author": "LobsterMost5947", "comment_Link_id": "t3_1b2kluj", "Create Date": "2024-04-24 04:58:48+00:00"}, {"comment_ID": "l103fqi", "comment_Body": "Any etl? \n\n    cat file.txt | sed 's/dog/cat/g'  > output.txt", "comment_Score": 1, "comment_Author": "baubleglue", "comment_Link_id": "t3_1ca3xs2", "Create Date": "2024-04-24 04:56:47+00:00"}, {"comment_ID": "l101kjs", "comment_Body": "Your intuitve solution is correct but it won't cover all the \"edge cases\". I hate those in the interview too.", "comment_Score": 1, "comment_Author": "SmartPersonality1862", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 04:39:58+00:00"}, {"comment_ID": "l101eso", "comment_Body": "Correct me if I'm wrong  but sounds like the interviewer ask you to find the top 3 product by whatever (let say sum of quantity sold). The most intuitive way is to agg and then sort it and take the top 3. But that won't work if let say you have 2 best selling product with the same quantity sold. If you hard code the limit 3 it will only return technically the top 2 (or even 1 if there's 3 product with the same quantity sold) right. So the solution have to be dense rank it using the sum of quantity and later put that in a subquery and use a where statement to check if the rank is <=3. Let me know if im wrong on this since i'm still a college student.", "comment_Score": 1, "comment_Author": "SmartPersonality1862", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 04:38:31+00:00"}, {"comment_ID": "l1012kf", "comment_Body": "thank you for the help and chatting with me. I finally got a working solution:\n\n* load the existing table in S3 into a DF\n* use DataframeWriter's `append` mode and Hudi's `delete` operation\n* write this deleted DF back to the same S3 location\n\nThe reason why Redshift spectrum does not support `insert_overwrite` is because it is unable to read the `replacecommit` metadata files. They only support `commit` files,  i looked through both of those files types and i did not see noticeably different between the two so there must be something i am unaware of", "comment_Score": 1, "comment_Author": "they_paid_for_it", "comment_Link_id": "t3_1c3yov5", "Create Date": "2024-04-24 04:35:29+00:00"}, {"comment_ID": "l100yqp", "comment_Body": "I embarrassed myself in my first job interview saying es-queue-ell instead of “sequel” because I was self-taught from books and practice and had never heard it said out loud 😭 \n\nThat said I did get the job though!", "comment_Score": 1, "comment_Author": "mr-jaybird", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 04:34:33+00:00"}, {"comment_ID": "l0zzbla", "comment_Body": "How quickly does the business really needs it? And as soon as we talk about enriching the data, the complexity jumps multiple times because we are now talking about joining and merging with other systems which may not be as quick as let’s say a kinesis firehose. If we already introducing this much latency, then maybe instead of real time, a near real solution which includes some batches (think Lambdas being triggered based on events) and such processes.\n\nSo imo, real time unless absolutely required and supported by existing infrastructure (as it’s usually\nMore expensive than batch or near real time) is not the first choice.  I’ve talking about massive amounts of data.", "comment_Score": 1, "comment_Author": "memyselfandi1987", "comment_Link_id": "t3_1cb8yh8", "Create Date": "2024-04-24 04:20:13+00:00"}, {"comment_ID": "l0zyjw8", "comment_Body": "Yeah 70 GB's is trivial. Save yourself the complexity and run it on sql", "comment_Score": 1, "comment_Author": "doinnuffin", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 04:13:38+00:00"}, {"comment_ID": "l0zxtzz", "comment_Body": "I agree with the others that, given your data volume, it makes sense that a single SQL Server is satisfying your needs in a way where the complexity of managing a lakehouse platform probably isn’t worth the squeeze of the orange. \n\nWhen you say development is more onerous, I’m curious if there’s anything specific that is causing pain in that area?", "comment_Score": 2, "comment_Author": "WHY-ARE-YOU-CLOSED", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 04:07:38+00:00"}, {"comment_ID": "l0zvvy0", "comment_Body": "Yea like that", "comment_Score": 1, "comment_Author": "dcent12345", "comment_Link_id": "t3_1cb3zbp", "Create Date": "2024-04-24 03:51:27+00:00"}, {"comment_ID": "l0zvjjo", "comment_Body": "A common core is nice. You may need others depending on security and complexity. Where I work, one department has pii governed by cjis and another stores phi. Others have arrangements that need to be isolated.", "comment_Score": 1, "comment_Author": "asevans48", "comment_Link_id": "t3_1cbkotm", "Create Date": "2024-04-24 03:48:40+00:00"}, {"comment_ID": "l0zv1u2", "comment_Body": "Same for me", "comment_Score": 1, "comment_Author": "natas_m", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 03:44:40+00:00"}, {"comment_ID": "l0zuzfc", "comment_Body": "That’s funny. I am a student myself, doing master of Business Analytics. Funny how this is not really a big issue when it comes to working with databases while I am currently struggling to fully understand it. What kind of questions were you asked at interviews? And did you work in these different position titles?", "comment_Score": 1, "comment_Author": "Radioheader377", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 03:44:07+00:00"}, {"comment_ID": "l0zuy9j", "comment_Body": "How quickly the results are needed.", "comment_Score": 1, "comment_Author": "RevolutionStill4284", "comment_Link_id": "t3_1cb8yh8", "Create Date": "2024-04-24 03:43:51+00:00"}, {"comment_ID": "l0zunbl", "comment_Body": "Serious question, does this actually come up for anyone in their day-to-day? I've been doing database work with various titles (SQL programmer, BI Engineer, BI Developer, Data Analyst, Data Engineer, probably some other random ones) and I have literally never heard a single person mention normal forms outside of one graduate class I took years ago. In my professional life, no one has ever said 3NF to me. I've worked in education, retail, and healthcare. For state agencies, public and private companies. Worked with data sets in the tens of thousands up to the hundreds of billions. On-prem setups and cloud infrastructures. Literally, not once, has anyone mentioned this at work, and if someone were to ask me about it in an interview I couldn't tell you the definition of any of them.", "comment_Score": 2, "comment_Author": "Mononon", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 03:41:25+00:00"}, {"comment_ID": "l0zsp1b", "comment_Body": "Love this channel. Why no mention of db2", "comment_Score": 1, "comment_Author": "Foodwithfloyd", "comment_Link_id": "t3_1cbef8q", "Create Date": "2024-04-24 03:26:11+00:00"}, {"comment_ID": "l0zshnp", "comment_Body": "I'm honestly still trying to figure out how all this works together. I've had enough experience (and read from others) that doing transformations in ADF is a nightmare. So, my thought would be to use ADF for orchestration but also for the extraction and loading of data from other systems, and then ADF would trigger stored procedures to transform and clean data and eventually kick data through to a gold layer.", "comment_Score": 2, "comment_Author": "e3thomps", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 03:24:38+00:00"}, {"comment_ID": "l0zrwt1", "comment_Body": "I’ve worked for a consultancy like this… Microsoft will often pay the consultancy a fee to build out engineering solutions on whatever the flavour of the day is.\n\nIf they can prove that X clients solution will cost £100k per year, they might offer £50k to the consultancy to build it out in synapses…", "comment_Score": 3, "comment_Author": "PumaPunku131", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 03:20:17+00:00"}, {"comment_ID": "l0zr5hu", "comment_Body": "Also MLE here, unfortunately I’ve heard business people say “or something similar to that. Would much rather hear SQL than whatever the hell that is.", "comment_Score": 1, "comment_Author": "Der_Krsto", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 03:14:33+00:00"}, {"comment_ID": "l0zo1k0", "comment_Body": "I second this.", "comment_Score": 1, "comment_Author": "SirGreybush", "comment_Link_id": "t3_1cbcfsv", "Create Date": "2024-04-24 02:51:59+00:00"}, {"comment_ID": "l0zne0p", "comment_Body": "Databricks is def better if you want to build a lakehouse. especially compared to fabric.", "comment_Score": 1, "comment_Author": "jerrie86", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 02:47:25+00:00"}, {"comment_ID": "l0zmwvq", "comment_Body": "Why do you think dbt metrics layers is better than Malloy? Last time I checked them out, it was still so immature to do anything serious there. I love dbt core as a product, but dbt metrics is just not there for me.", "comment_Score": 2, "comment_Author": "9diov_polymath", "comment_Link_id": "t3_1cb3zbp", "Create Date": "2024-04-24 02:44:07+00:00"}, {"comment_ID": "l0zmo4t", "comment_Body": "Director and data architect here.  I've done lots of interviews for devs and data engineers.  I never do code interviews except when executive management forces it (even though none of them code).  There are so many tech stacks, languages and flavors that finding someone with exactly the right skill set would be near impossible.  That skill set would also be obsolete in a couple years.  I'm looking for people who understand structure and patterns and can apply that in a logical way.  IDEs, Google, and now code assistant AI are how you handle figuring out syntax.  I've been doing this for nearly 20 years and I still Google syntax, optimization strategies, etc etc.  The Oracle optimizer has changed so much since I started, it would make no sense for me to test someone on optimal code syntax in version xx.xx. I figure out what I want done, map it out in pseudo code, and pull together what I need to implement it.  You don't last in this business just memorizing the syntax for a windowing function.", "comment_Score": 2, "comment_Author": "FrebTheRat", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 02:42:28+00:00"}, {"comment_ID": "l0zmi9a", "comment_Body": "It means the product/feature is available for the public to use/purchase.\n\nhttps://en.m.wikipedia.org/wiki/Software_release_life_cycle", "comment_Score": 2, "comment_Author": "thatrandomnpc", "comment_Link_id": "t3_1cbkvjb", "Create Date": "2024-04-24 02:41:21+00:00"}, {"comment_ID": "l0zmfv9", "comment_Body": "Stop it at 1FN, CustomerName and VehicleName should not be there ...", "comment_Score": 1, "comment_Author": "umlcat", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 02:40:54+00:00"}, {"comment_ID": "l0zm9x5", "comment_Body": "\"Normalization is obsolete\" new CS/IT generations ...", "comment_Score": 1, "comment_Author": "umlcat", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 02:39:46+00:00"}, {"comment_ID": "l0zm8r0", "comment_Body": "‘We’ll name the new one Fabric!’ ", "comment_Score": 5, "comment_Author": "Squidssential", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 02:39:33+00:00"}, {"comment_ID": "l0zl8on", "comment_Body": "Grafana allows for dashboard provisioning through JSON.", "comment_Score": 2, "comment_Author": "shmorkin3", "comment_Link_id": "t3_1cb3zbp", "Create Date": "2024-04-24 02:32:36+00:00"}, {"comment_ID": "l0zk2po", "comment_Body": "Company name are name, they are not suppose to be word in the dictionary. Do you take something like Lyft seriously? They would also show up as typo btw.", "comment_Score": 2, "comment_Author": "TMDCMNR", "comment_Link_id": "t3_1cb3zbp", "Create Date": "2024-04-24 02:24:36+00:00"}, {"comment_ID": "l0zjk69", "comment_Body": "Sankeymatic.com", "comment_Score": 1, "comment_Author": "Thaladan", "comment_Link_id": "t3_1camjik", "Create Date": "2024-04-24 02:21:09+00:00"}, {"comment_ID": "l0zhn12", "comment_Body": "I'm sorry, what does general availability mean?", "comment_Score": 3, "comment_Author": "My_Apps", "comment_Link_id": "t3_1cbkvjb", "Create Date": "2024-04-24 02:08:24+00:00"}, {"comment_ID": "l0zh9fx", "comment_Body": "Out of curiosity, would ADF just be used here as an orchestration tool?", "comment_Score": 1, "comment_Author": "ManiaMcG33_", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 02:05:57+00:00"}, {"comment_ID": "l0zfkbr", "comment_Body": "I think conceptually you’re right but terraform can be used today to deploy everything the bundles are meant to deploy too", "comment_Score": 1, "comment_Author": "TeleTummies", "comment_Link_id": "t3_1cbkvjb", "Create Date": "2024-04-24 01:54:53+00:00"}, {"comment_ID": "l0zf6cf", "comment_Body": ">Lakehouse is generally for when you want to store a whole lot of stuff and figure out what to do with it later.\n\nYep. To expand the context outside business, a public database would benefit as a lakehouse since you want \"someone else to figure what to do with it\".", "comment_Score": 0, "comment_Author": "ThatSituation9908", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 01:52:26+00:00"}, {"comment_ID": "l0zegcp", "comment_Body": "I'm passionate about teaching!", "comment_Score": 1, "comment_Author": "vladproex", "comment_Link_id": "t3_1carssa", "Create Date": "2024-04-24 01:47:45+00:00"}]