[{"comment_ID": "l1bs64u", "comment_Body": "I am confused with your reply", "comment_Score": 1, "comment_Author": "InsightByte", "comment_Link_id": "1cd8xbl", "Create Date": "2024-04-26 09:24:41+00:00"}, {"comment_ID": "l1brsxl", "comment_Body": "One entry / second means you'll have 84k entries / day and 31 million / year. \n\n\nThats not really large. \n\n\nGoing by your other reqs you'll be fine with Postgres so I'm not ensure what lead you to consider Neo4J..", "comment_Score": 1, "comment_Author": "IDENTITETEN", "comment_Link_id": "1cd1ce6", "Create Date": "2024-04-26 09:20:07+00:00"}, {"comment_ID": "l1brgdo", "comment_Body": "Just wanted to say I read this post two months ago and it inspired me to keep trying. No job yet but I do have interviews. Thx for the mind set", "comment_Score": 1, "comment_Author": "PromptAmbitious5387", "comment_Link_id": "18btyeq", "Create Date": "2024-04-26 09:15:47+00:00"}, {"comment_ID": "l1bq3pr", "comment_Body": "At my company we use spark mostly, we started as a statistician led shop (R + Cpp) but later converted to mostly python and spark and sparkql when engineers started coming, we still use RCpp wrapped in services for crunching data that needs to be high performance but then it all goes to the datalake to be made available.  \nAll spark stuff is easy to mantain, all cpp stuff is touch with a 10ft pole.", "comment_Score": 2, "comment_Author": "jcliberatol", "comment_Link_id": "1cdg89d", "Create Date": "2024-04-26 08:59:06+00:00"}, {"comment_ID": "l1bpv4x", "comment_Body": "You could give Apache Airflow a try", "comment_Score": 1, "comment_Author": "NipponPanda", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 08:56:09+00:00"}, {"comment_ID": "l1bpj4c", "comment_Body": "You can find a list of community-submitted learning resources here: https://dataengineering.wiki/Learning+Resources\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataengineering) if you have any questions or concerns.*", "comment_Score": 1, "comment_Author": "AutoModerator", "comment_Link_id": "1cdgi6u", "Create Date": "2024-04-26 08:51:58+00:00"}, {"comment_ID": "l1bouak", "comment_Body": "even if i choose to compare the \"Topic\" and the \"search term\" it's the same result : [https://ibb.co/sjPSmQv](https://ibb.co/sjPSmQv)", "comment_Score": 1, "comment_Author": "Acceptable-Sail-4575", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:43:20+00:00"}, {"comment_ID": "l1bop6i", "comment_Body": "Streamlit worth looking into as well, it’s able to cover BI and custom DataApps", "comment_Score": 1, "comment_Author": "No-Database2068", "comment_Link_id": "1ccs3vs", "Create Date": "2024-04-26 08:41:34+00:00"}, {"comment_ID": "l1booc7", "comment_Body": "Is it well established?\nDoes it have a track record of meeting the use case you have?\nIs there professional support services available for it?\nIs it open source?\nIs it part of the apache foundation or the like?\nDo cloud vendors have options for deployment if it?\n\nYes to all of the above?, boring as fuck. Use it.", "comment_Score": 5, "comment_Author": "daripious", "comment_Link_id": "1cdg89d", "Create Date": "2024-04-26 08:41:17+00:00"}, {"comment_ID": "l1bnzx5", "comment_Body": "I believe you need to select \"Topic\" rather than \"search term\" (or in your case, terme de recherche )", "comment_Score": 2, "comment_Author": "engineer_of-sorts", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:32:40+00:00"}, {"comment_ID": "l1bny0i", "comment_Body": "I think there's a bit of a misunderstanding about what I'm saying. Everyone's knowledge and abilities are limited. Of course, I will do my best to provide the most accurate information that I believe in, but I cannot guarantee that I will not make mistakes. We can't stop discussing because we're afraid of making mistakes, that's the purpose of the community. It allows for the expression and collision of different opinions. As for this post, I'm just a catalyst. I hope everyone has their own views on this kind of comparative content. I am not here as a knowledge instiller. I also don't want to turn our conversation into an emotional confrontation, which is meaningless. For such emotional confrontations, I think this will be my last reply. As for the content provided in the table, you are free to express your opinions. Whether you agree with everything or find some items unreasonable is fine. Friends of Redpanda have set a good example and have made the table more objective and accurate. I look forward to such discussions.", "comment_Score": 1, "comment_Author": "wanshao", "comment_Link_id": "1ccodiy", "Create Date": "2024-04-26 08:31:58+00:00"}, {"comment_ID": "l1bnuno", "comment_Body": "Hey, don't call me out like that.. 🤣", "comment_Score": 1, "comment_Author": "whyareyoustalkinghuh", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 08:30:48+00:00"}, {"comment_ID": "l1bnj0x", "comment_Body": "I think some one played with the numbers, i re-checked the values and here you go : [https://ibb.co/vvYSKc1](https://ibb.co/vvYSKc1)\n\nthe Interest for data engineer is the same for the moment.", "comment_Score": 1, "comment_Author": "Acceptable-Sail-4575", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:26:46+00:00"}, {"comment_ID": "l1bmwbp", "comment_Body": "That's a pathetic argument - I should be skeptical of everything you put? Just don't put skeptical stuff up", "comment_Score": 1, "comment_Author": "Ok_Raspberry5383", "comment_Link_id": "1ccodiy", "Create Date": "2024-04-26 08:18:52+00:00"}, {"comment_ID": "l1bmp5i", "comment_Body": "Fullstack data (engineering) ??\n\nHonestly I hear a lot of DEs (me included when I was in such roles) complain about being too far removed from the actual tangible value delivered: those shiny dashboards.\nThe only way I've had the chance of getting closer to this value was working for very small teams where I could own the problem from start to end.\n\nHence \"fullstack data\" is the only way I see to reconcile doing both technical work (setting the foundations) and seeing the actual value that provides in the end...\n\nAnd what I find is actually that there's often more value in delivering individual insights to the tools that the business teams use, rather than the shiny dashboards a lot of people have associated data teams with ..", "comment_Score": 1, "comment_Author": "briceluu", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:16:23+00:00"}, {"comment_ID": "l1bljlk", "comment_Body": "I second this. For this size of data is really the quickest thing to setup.", "comment_Score": 1, "comment_Author": "wtfzambo", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 08:01:56+00:00"}, {"comment_ID": "l1blb49", "comment_Body": "Yes wsl2 + vscode + powertoys.\nBest combo", "comment_Score": 2, "comment_Author": "rodeslab", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 07:59:01+00:00"}, {"comment_ID": "l1bl8jz", "comment_Body": "The founder is a nice dude but I'm not a fan of the product itself, despite it being branded exactly to attract people like me.\n\nNotebook interfaces give me the ick.\n\nThis said, I'm gonna offer a different perspective.\n\nI feel like in our community, having an orchestrator in one's own pipeline is a must, kind of like having running water in a house.\n\nBut to be honest, I'm starting to think that this is a dogma parroted through the years, and that in a lot of cases, orchestrators don't fit at all and are actually overkill.\n\nIn most system I worked with, just once I thought an orchestrator was necessary.\n\nObviously, this is my subjective experience, but let me ask you: what do you think you need an orchestrator for?", "comment_Score": 2, "comment_Author": "wtfzambo", "comment_Link_id": "1cda190", "Create Date": "2024-04-26 07:58:09+00:00"}, {"comment_ID": "l1bkh2p", "comment_Body": "at my saas company we have (10) DEs on the customer side (data extraction and integration, etl) and (1) DE on the platform side. customer side has weekly rotating on call during the pipeline hours (8am-8pm). and during weekends", "comment_Score": 1, "comment_Author": "ImportantAward4608", "comment_Link_id": "1cd6v3c", "Create Date": "2024-04-26 07:48:46+00:00"}, {"comment_ID": "l1bk96n", "comment_Body": "I recently moved to Windows with WSL2, it's going well so far. The WSL plugin for vscode is perfect for me, as it's just like using vscode in Linux.\n\nMake sure to only use programs installed in WSL while you're inside WSL though. I had the gcloud CLI installed on Windows and it would take a very long time to run any gcloud command as the interop performance on WSL2 is not optimal. Once I uninstalled the gcloud CLI on Windows and reinstalled on WSL it was much faster", "comment_Score": 4, "comment_Author": "hennyblub", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 07:46:04+00:00"}, {"comment_ID": "l1bjxj7", "comment_Body": "Are you interested in transitioning into Data Engineering? Read our community guide: https://dataengineering.wiki/FAQ/How+can+I+transition+into+Data+Engineering\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataengineering) if you have any questions or concerns.*", "comment_Score": 1, "comment_Author": "AutoModerator", "comment_Link_id": "1cdfiow", "Create Date": "2024-04-26 07:42:03+00:00"}, {"comment_ID": "l1bjxip", "comment_Body": "You can find a list of community-submitted learning resources here: https://dataengineering.wiki/Learning+Resources\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataengineering) if you have any questions or concerns.*", "comment_Score": 1, "comment_Author": "AutoModerator", "comment_Link_id": "1cdfiow", "Create Date": "2024-04-26 07:42:03+00:00"}, {"comment_ID": "l1bjlhs", "comment_Body": "Pretty much this.\n\nUnless you are distrohopper.", "comment_Score": 1, "comment_Author": "n3pst3r_007", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 07:37:57+00:00"}, {"comment_ID": "l1bjgso", "comment_Body": "i personally like to do ELT , that means that i load whole dataset from source and store it to stg, then i process all known columns. This, when you keep stg for longer term allows you to implement handling to new columns on your own time frame. This is how i roll it, there is no column renames ( or deletes ,as rename is delete and create new one). Flow is to add new shit , communicate, makes changes to downstream and when some name is no longer in use, it can be removed from source. \n\nIf some column needs to renamed, flow is to add copy of data to new name, communicate, make all changes, and then remove old one. Anything else in inefficient and error prone. \n\nThis also allows development model where small changes can be pushed to production constantly and this allows downstream to catch up to changes on every layer on their time frame. There is problems if adding new column causes any concerns that old stuff stops to work. \n\nthis comes from sql side experience, but it is same for all envronments. There is challenges in datmodel if fields need to renamed constantly. usually adding new one is enough ( except when cleaning is done, that means that interface is no compliant with previous versions which leads to api versioning concept etc etc )", "comment_Score": 1, "comment_Author": "throw_mob", "comment_Link_id": "1cd4p69", "Create Date": "2024-04-26 07:36:20+00:00"}, {"comment_ID": "l1bixbo", "comment_Body": "For a work machine, the only issue I have found is internet security blocking urls needed for package installs. How big an issue this is depends on how competent/overzealous your IT are. I run Ubuntu and usually downloading a .deb and installing from that gets around this.", "comment_Score": 3, "comment_Author": "speedisntfree", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 07:29:39+00:00"}, {"comment_ID": "l1bibjh", "comment_Body": "20 Years of experience w/ DBT.", "comment_Score": 1, "comment_Author": "FUCKYOUINYOURFACE", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 07:22:19+00:00"}, {"comment_ID": "l1bi0ks", "comment_Body": "Isn’t it cheaper to just run a cron job? I don’t understand why people are jumping to cloud solutions on this (which could cost money) but maybe I’m uninformed", "comment_Score": 2, "comment_Author": "Xerionik", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 07:18:44+00:00"}, {"comment_ID": "l1bhb02", "comment_Body": "DWH is thing of the past. Top management can’t see value. Latest trend is dump all data in lakes, Slap the AI sticker and magic will happen!!", "comment_Score": 1, "comment_Author": "SGManto", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 07:10:31+00:00"}, {"comment_ID": "l1bgoqj", "comment_Body": "Firm believer the Data Orchestration topic lags the Data Engineering topic as well", "comment_Score": 1, "comment_Author": "engineer_of-sorts", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 07:03:27+00:00"}, {"comment_ID": "l1bgk11", "comment_Body": "too late. it's in prod now", "comment_Score": 5, "comment_Author": "firespoon", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 07:01:56+00:00"}, {"comment_ID": "l1bf0rl", "comment_Body": "Dagster. It's a good tool. But I am also interested in Kestra.", "comment_Score": 1, "comment_Author": "peekaboo1412", "comment_Link_id": "1ccueqx", "Create Date": "2024-04-26 06:44:30+00:00"}, {"comment_ID": "l1baudk", "comment_Body": "> My question is do you have to be on-call as a Data Engineer?\n\nDepends on:\n\n1. The company tech organization: are \"devops admins\" going to support your production environment or do you have to do it yourself?\n2. Is your data served to external clients?: if your clients are the nearby team, you can just chat with them if there's an issue and you can probably solve it after the weekend. But if it appears in a client app over the weekend, you'll probably have to support it on weekend to avoid customer backslash.\n3. What your contract mentions.\n\nMost of my jobs, I didn't have to do that, but currently I have to and I hate it.\n\nI think you can quite easily ask those questions during the interviews and decide if the cost/benefit is good for you. In my case, there was a notable benefit that made me accept the cost.", "comment_Score": 1, "comment_Author": "sib_n", "comment_Link_id": "1cd6v3c", "Create Date": "2024-04-26 05:59:12+00:00"}, {"comment_ID": "l1bal4c", "comment_Body": "Big fan of Temporal, also Hatchet looks promising", "comment_Score": 1, "comment_Author": "BigCaregiver7285", "comment_Link_id": "1ccueqx", "Create Date": "2024-04-26 05:56:32+00:00"}, {"comment_ID": "l1bajve", "comment_Body": "1. Data Engineer\n2. 5 years fulltime 2 years parttime\n3. Netherlands\n4. 90k plus 1k monthly lease budget euro\n5. 10k euro bonus end year\n6. Worked for railways and energy markets.\n7. Azure, docker, functions, adf, containers, terraform, snowflake", "comment_Score": 1, "comment_Author": "Present_Tradition_24", "comment_Link_id": "1b3zatv", "Create Date": "2024-04-26 05:56:11+00:00"}, {"comment_ID": "l1badnm", "comment_Body": "https://community.sap.com/t5/technology-blogs-by-sap/guidance-for-partners-on-certifying-their-data-integration-offerings-with/ba-p/13578551\n\n“Usage of ODP RFC API: For real-time integration with external applications the usage of RFC modules of the Operational Data Provisioning (ODP) Data Replication API by customers or third-party applications is NOT permitted, as documented in SAP Note 3255746.Similarly, usage of other unreleased RFCs directly or via OData/Webservices is not a recommended integration approach”\n\n🙄", "comment_Score": 1, "comment_Author": "Remote_Temperature", "comment_Link_id": "1ccv2r3", "Create Date": "2024-04-26 05:54:21+00:00"}, {"comment_ID": "l1ba287", "comment_Body": "WSL is great. yes you can run GUI apps in it. no complaints. make sure to download the windows terminal app and you will be good to go", "comment_Score": 3, "comment_Author": "EnthusiasticRetard", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 05:51:00+00:00"}, {"comment_ID": "l1b8ri7", "comment_Body": "The features I need are a security and high volume storage:\n\na) I will get a bulk of for example 3600 entries that I need to push to the db. \nb) Furthermore, location data per user will be stored to see if  another user is nearby. \nc) And the chats between two users/group will be stored, but I am not sure if that needs to be in the NoSQL.\n\nUpdates are less likely, data gets stored and get queried.\n\nThe frequency of sending large pieces of data (I.e. 3600+ records will happen often. \n\nSecurity is really important - that’s a no brainer for me.", "comment_Score": 1, "comment_Author": "__bdude", "comment_Link_id": "1cd1ce6", "Create Date": "2024-04-26 05:37:34+00:00"}, {"comment_ID": "l1b8dmm", "comment_Body": "I think traditional BI will come back at some point. There has been an AE hype but there is still not a lot of jobs opening (vs more heavy technical DE). I think a lot of companies start to have robust data infrastructures, but when you look at the schema, tables (sometimes no data warehouse, shitty data marts) you start to cry … so BI to clean this mess with governance.", "comment_Score": 2, "comment_Author": "His0kx", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 05:33:41+00:00"}, {"comment_ID": "l1b802y", "comment_Body": "Appreciate this response 🙏", "comment_Score": 1, "comment_Author": "Thiseffingguy2", "comment_Link_id": "1cbx8bb", "Create Date": "2024-04-26 05:29:53+00:00"}, {"comment_ID": "l1b7iw4", "comment_Body": "Check Google Cortex. It has the full Modeling out of the shelf. Also, There is an internal SAP table which has all tables and columns with descriptions. Also one with relations. Good luck in your journey.", "comment_Score": 1, "comment_Author": "alexl0ok", "comment_Link_id": "1ccv2r3", "Create Date": "2024-04-26 05:25:03+00:00"}]