[{"comment_ID": "l1bxw10", "comment_Body": "I disagree that you need 10 CTEs stacked on one another to do basic transformations in SQL. Coupling transformations at the same aggregation level together produces far fewer lines of SQL", "comment_Score": 1, "comment_Author": "Grovbolle", "comment_Link_id": "1cdha2w", "Create Date": "2024-04-26 10:29:34+00:00"}, {"comment_ID": "l1bxr9z", "comment_Body": "This looks solid. Curious to find out if you think Airbyte would be a good addition for moving data to Postgres?", "comment_Score": 1, "comment_Author": "chonbee", "comment_Link_id": "1ccs3vs", "Create Date": "2024-04-26 10:28:10+00:00"}, {"comment_ID": "l1bxq26", "comment_Body": "Hey there u/erik0422, thanks for mentioning that as a solution. We're looking to do something similar and was hoping you have some advice. We have all our data in databricks delta tables, and were looking to use Trino instead of Databricks' SQL Serveless Warehouse to save on costs. Trino has a Delta Lake connector which we were hoping to use without having to migrate the data (https://trino.io/docs/current/connector/delta-lake.html)\n\n  \nWe found Amazon EMR has support for Trino embedded (https://docs.aws.amazon.com/emr/latest/ReleaseGuide/emr-presto.html) - is that something you used, and were able to connected to Delta Lake with? Thanks in advance for taking the time!", "comment_Score": 1, "comment_Author": "pragyajswl", "comment_Link_id": "1c42ckw", "Create Date": "2024-04-26 10:27:50+00:00"}, {"comment_ID": "l1bxpf8", "comment_Body": "Agree with this, but, I just use the VPN tools in windows as I do need to hop, given the Microsoft suite employed (e.g., Teams). Might be the one caveat for you OP: use VPN tools in windows, but do your heavy lifting in WSL2. Working like a charm on my end.", "comment_Score": 1, "comment_Author": "dgrsmith", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 10:27:38+00:00"}, {"comment_ID": "l1bxkg6", "comment_Body": "Data Engineering is a flavour of Software Engineering. If you work on anything with backends/data etc you'll be well qualified for DE type roles/possibly be doing one under a different name. \n\n\n\n>Moreover, I'm curious about the salary prospects for freshers in the data engineering domain. Can I expect a competitive salary despite my lack of professional experience?\n\nNo more or less than any other technical role. Outside of a few outliers who win math prizes etc then you are normally less competitive as a Junior anyway. I wouldn't worry too much about it out the gate it'll grow very quickly over a couple years.", "comment_Score": 1, "comment_Author": "tdatas", "comment_Link_id": "1cdfiow", "Create Date": "2024-04-26 10:26:11+00:00"}, {"comment_ID": "l1bxdsq", "comment_Body": "I am doing this solo with some prepaid consultancy hours. Good thing the dwh is pretty simple but I do feel a bit stuck in place.", "comment_Score": 1, "comment_Author": "Demistr", "comment_Link_id": "1cdgbjw", "Create Date": "2024-04-26 10:24:15+00:00"}, {"comment_ID": "l1bx7sb", "comment_Body": "That’s kinda sad. I’ve been there.", "comment_Score": 1, "comment_Author": "nydasco", "comment_Link_id": "1cdgbjw", "Create Date": "2024-04-26 10:22:27+00:00"}, {"comment_ID": "l1bx535", "comment_Body": "Wrap everything in cte and select from them at the end.\n\n CTEs should be written with some logic behind it, every cte should do a specific thing if possible.\n\nFor example one cte for exchange rate calc, one for accounting cc split etc.\n\nDebugging long procs is pretty difficult by itself. I don't think you can set breakpoints like in Vs code.", "comment_Score": 1, "comment_Author": "Demistr", "comment_Link_id": "1cdha2w", "Create Date": "2024-04-26 10:21:41+00:00"}, {"comment_ID": "l1bwm3s", "comment_Body": "Just curious, where does the compute run here? Do we need to point to an EC2 machine?", "comment_Score": 1, "comment_Author": "Comfortable_Spread", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 10:16:03+00:00"}, {"comment_ID": "l1bwifn", "comment_Body": "There's noone at work to review my shit lol.", "comment_Score": 1, "comment_Author": "Demistr", "comment_Link_id": "1cdgbjw", "Create Date": "2024-04-26 10:14:57+00:00"}, {"comment_ID": "l1bwdr4", "comment_Body": "Both have a free tier and don't require a device running so as long as it's completely within the free tier, it's actually cheaper than running cron jobs on your own device.", "comment_Score": 1, "comment_Author": "HappEMason", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 10:13:32+00:00"}, {"comment_ID": "l1bw94g", "comment_Body": "I pretty much do this. Just install Linux versions of every software (vscode, docker, etc) directly in WSL2 and ignore windows completely, apart from chat/email. \n\nThe only issues are that if it’s a work machine, networking can sometimes be a pain in the ass with VPNs, especially when running containers. There are some hacky ways around this (wsl vpn kit works pretty well https://github.com/sakai135/wsl-vpnkit), but sometimes you have to give up and use windows. All in all though, it’s been working very well for me.", "comment_Score": 1, "comment_Author": "kyleekol", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 10:12:09+00:00"}, {"comment_ID": "l1bvyq2", "comment_Body": "Sorry to hijack your post but I'm currently thinking about purchasing a laptop for freelance work. I mainly work with Azure with the odd AWS/GCP stuff every now and then.\n\nI'm considering a Surface Laptop 6 or MacBook Air M3, both with 16GB RAM. I have a high-end desktop PC which I could remote desktop into from Mac if necessary.\n\nI used to have a Mac so I know how nice they are to work with. On the other hand, as I'm mainly working on Azure I should just stick to windows.\n\nWhat do you think? Should I go for Mac? Or should I just go windows all the way?", "comment_Score": 1, "comment_Author": "chonbee", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 10:09:00+00:00"}, {"comment_ID": "l1bvr42", "comment_Body": "I second u/Separate approach about taking a step back for a birds eye view. Working out what you eat", "comment_Score": 1, "comment_Author": "National-Two-8876", "comment_Link_id": "1ccy0s6", "Create Date": "2024-04-26 10:06:39+00:00"}, {"comment_ID": "l1bv4qy", "comment_Body": "Im saying dont use data hub write an api that matches your domain and a ui that displays your assets. If you use datahub and extend it to meet your needs you will commit just as much dev time.", "comment_Score": 1, "comment_Author": "I-mean-maybe", "comment_Link_id": "1cd8xbl", "Create Date": "2024-04-26 09:59:42+00:00"}, {"comment_ID": "l1buxg3", "comment_Body": "Firstly, thank you for  your insights. To give a bit more context: the entries will be times x-amount of users at a given moment. But I am exploring the opportunities to have a robust design for my application which when needed is easly scalable. I am familiar with relational databases and I thought there could be an issue and looked for NoSQL databases to store a lot of info. And was looking into neo4j and elastic search.", "comment_Score": 1, "comment_Author": "__bdude", "comment_Link_id": "1cd1ce6", "Create Date": "2024-04-26 09:57:25+00:00"}, {"comment_ID": "l1bux8v", "comment_Body": "I don't know why people feel that windows is all about gui.\n\nAs if mac and linux distros don't have gui at all.\n\nWindows has wsl, you also alternately have dev containers, dockers. You can use alacritty.", "comment_Score": 1, "comment_Author": "n3pst3r_007", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 09:57:22+00:00"}, {"comment_ID": "l1buqwr", "comment_Body": "So transitioning from other roles is the only way to get into data engineering?", "comment_Score": 1, "comment_Author": "ZenphyriX", "comment_Link_id": "1cdfiow", "Create Date": "2024-04-26 09:55:21+00:00"}, {"comment_ID": "l1buogu", "comment_Body": "I see, got it.. do you mind sharing the rough estimate of the workload.. just to get an idea.. :)", "comment_Score": 1, "comment_Author": "Tumbleweed-Afraid", "comment_Link_id": "1c8thmh", "Create Date": "2024-04-26 09:54:35+00:00"}, {"comment_ID": "l1buiza", "comment_Body": "Can we somehow move expectations to csv as well?", "comment_Score": 1, "comment_Author": "NikitaPoberezkin", "comment_Link_id": "198w13u", "Create Date": "2024-04-26 09:52:49+00:00"}, {"comment_ID": "l1btjed", "comment_Body": "Thank you for this.\n\nTo be honest it ended up being the latter. I spoke to my lead and he agreed that sometimes you just need to see something done a few times before you can start debugging it (he’s from a cloud background too so he understands the transition pains). I’m happy to do on-prem a bit, but we should be moving to cloud soon almost completely. I just don’t want to pick up tools that will be redundant very soon.", "comment_Score": 1, "comment_Author": "JackalTheFulgid", "comment_Link_id": "1ccrag8", "Create Date": "2024-04-26 09:41:12+00:00"}, {"comment_ID": "l1bt90w", "comment_Body": "spark is a wonder of the world", "comment_Score": 3, "comment_Author": "sebastiandang", "comment_Link_id": "1cdg89d", "Create Date": "2024-04-26 09:37:49+00:00"}, {"comment_ID": "l1bsyju", "comment_Body": "No you're presenting opinions as fact. That's not doing your best, mistakes are fine but at least have a shred of self awareness", "comment_Score": 0, "comment_Author": "Ok_Raspberry5383", "comment_Link_id": "1ccodiy", "Create Date": "2024-04-26 09:34:21+00:00"}, {"comment_ID": "l1bstbw", "comment_Body": "Probably not. It is not an entry level role.", "comment_Score": 1, "comment_Author": "Thin_Platform5774", "comment_Link_id": "1cdfiow", "Create Date": "2024-04-26 09:32:34+00:00"}, {"comment_ID": "l1bsp06", "comment_Body": "can you share the code?", "comment_Score": 1, "comment_Author": "rental_car_abuse", "comment_Link_id": "1cbx8bb", "Create Date": "2024-04-26 09:31:05+00:00"}, {"comment_ID": "l1bs64u", "comment_Body": "I am confused with your reply", "comment_Score": 1, "comment_Author": "InsightByte", "comment_Link_id": "1cd8xbl", "Create Date": "2024-04-26 09:24:41+00:00"}, {"comment_ID": "l1brsxl", "comment_Body": "One entry / second means you'll have 84k entries / day and 31 million / year. \n\n\nThats not really large. \n\n\nGoing by your other reqs you'll be fine with Postgres so I'm not ensure what lead you to consider Neo4J..", "comment_Score": 1, "comment_Author": "IDENTITETEN", "comment_Link_id": "1cd1ce6", "Create Date": "2024-04-26 09:20:07+00:00"}, {"comment_ID": "l1brgdo", "comment_Body": "Just wanted to say I read this post two months ago and it inspired me to keep trying. No job yet but I do have interviews. Thx for the mind set", "comment_Score": 1, "comment_Author": "PromptAmbitious5387", "comment_Link_id": "18btyeq", "Create Date": "2024-04-26 09:15:47+00:00"}, {"comment_ID": "l1bq3pr", "comment_Body": "At my company we use spark mostly, we started as a statistician led shop (R + Cpp) but later converted to mostly python and spark and sparkql when engineers started coming, we still use RCpp wrapped in services for crunching data that needs to be high performance but then it all goes to the datalake to be made available.  \nAll spark stuff is easy to mantain, all cpp stuff is touch with a 10ft pole.", "comment_Score": 2, "comment_Author": "jcliberatol", "comment_Link_id": "1cdg89d", "Create Date": "2024-04-26 08:59:06+00:00"}, {"comment_ID": "l1bpv4x", "comment_Body": "You could give Apache Airflow a try", "comment_Score": 1, "comment_Author": "NipponPanda", "comment_Link_id": "1cd0tmv", "Create Date": "2024-04-26 08:56:09+00:00"}, {"comment_ID": "l1bpj4c", "comment_Body": "You can find a list of community-submitted learning resources here: https://dataengineering.wiki/Learning+Resources\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dataengineering) if you have any questions or concerns.*", "comment_Score": 1, "comment_Author": "AutoModerator", "comment_Link_id": "1cdgi6u", "Create Date": "2024-04-26 08:51:58+00:00"}, {"comment_ID": "l1bouak", "comment_Body": "even if i choose to compare the \"Topic\" and the \"search term\" it's the same result : [https://ibb.co/sjPSmQv](https://ibb.co/sjPSmQv)", "comment_Score": 1, "comment_Author": "Acceptable-Sail-4575", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:43:20+00:00"}, {"comment_ID": "l1bop6i", "comment_Body": "Streamlit worth looking into as well, it’s able to cover BI and custom DataApps", "comment_Score": 1, "comment_Author": "No-Database2068", "comment_Link_id": "1ccs3vs", "Create Date": "2024-04-26 08:41:34+00:00"}, {"comment_ID": "l1booc7", "comment_Body": "Is it well established?\nDoes it have a track record of meeting the use case you have?\nIs there professional support services available for it?\nIs it open source?\nIs it part of the apache foundation or the like?\nDo cloud vendors have options for deployment if it?\n\nYes to all of the above?, boring as fuck. Use it.", "comment_Score": 11, "comment_Author": "daripious", "comment_Link_id": "1cdg89d", "Create Date": "2024-04-26 08:41:17+00:00"}, {"comment_ID": "l1bnzx5", "comment_Body": "I believe you need to select \"Topic\" rather than \"search term\" (or in your case, terme de recherche )", "comment_Score": 2, "comment_Author": "engineer_of-sorts", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:32:40+00:00"}, {"comment_ID": "l1bny0i", "comment_Body": "I think there's a bit of a misunderstanding about what I'm saying. Everyone's knowledge and abilities are limited. Of course, I will do my best to provide the most accurate information that I believe in, but I cannot guarantee that I will not make mistakes. We can't stop discussing because we're afraid of making mistakes, that's the purpose of the community. It allows for the expression and collision of different opinions. As for this post, I'm just a catalyst. I hope everyone has their own views on this kind of comparative content. I am not here as a knowledge instiller. I also don't want to turn our conversation into an emotional confrontation, which is meaningless. For such emotional confrontations, I think this will be my last reply. As for the content provided in the table, you are free to express your opinions. Whether you agree with everything or find some items unreasonable is fine. Friends of Redpanda have set a good example and have made the table more objective and accurate. I look forward to such discussions.", "comment_Score": 1, "comment_Author": "wanshao", "comment_Link_id": "1ccodiy", "Create Date": "2024-04-26 08:31:58+00:00"}, {"comment_ID": "l1bnuno", "comment_Body": "Hey, don't call me out like that.. 🤣", "comment_Score": 1, "comment_Author": "whyareyoustalkinghuh", "comment_Link_id": "1cdc878", "Create Date": "2024-04-26 08:30:48+00:00"}, {"comment_ID": "l1bnj0x", "comment_Body": "I think some one played with the numbers, i re-checked the values and here you go : [https://ibb.co/vvYSKc1](https://ibb.co/vvYSKc1)\n\nthe Interest for data engineer is the same for the moment.", "comment_Score": 2, "comment_Author": "Acceptable-Sail-4575", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:26:46+00:00"}, {"comment_ID": "l1bmwbp", "comment_Body": "That's a pathetic argument - I should be skeptical of everything you put? Just don't put skeptical stuff up", "comment_Score": 1, "comment_Author": "Ok_Raspberry5383", "comment_Link_id": "1ccodiy", "Create Date": "2024-04-26 08:18:52+00:00"}, {"comment_ID": "l1bmp5i", "comment_Body": "Fullstack data (engineering) ??\n\nHonestly I hear a lot of DEs (me included when I was in such roles) complain about being too far removed from the actual tangible value delivered: those shiny dashboards.\nThe only way I've had the chance of getting closer to this value was working for very small teams where I could own the problem from start to end.\n\nHence \"fullstack data\" is the only way I see to reconcile doing both technical work (setting the foundations) and seeing the actual value that provides in the end...\n\nAnd what I find is actually that there's often more value in delivering individual insights to the tools that the business teams use, rather than the shiny dashboards a lot of people have associated data teams with ..", "comment_Score": 1, "comment_Author": "briceluu", "comment_Link_id": "1ccsf39", "Create Date": "2024-04-26 08:16:23+00:00"}]