[{"comment_ID": "l0zfkbr", "comment_Body": "I think conceptually you’re right but terraform can be used today to deploy everything the bundles are meant to deploy too", "comment_Score": 1, "comment_Author": "TeleTummies", "comment_Link_id": "t3_1cbkvjb", "Create Date": "2024-04-24 01:54:53+00:00"}, {"comment_ID": "l0zf6cf", "comment_Body": ">Lakehouse is generally for when you want to store a whole lot of stuff and figure out what to do with it later.\n\nYep. To expand the context outside business, a public database would benefit as a lakehouse since you want \"someone else to figure what to do with it\".", "comment_Score": 1, "comment_Author": "ThatSituation9908", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 01:52:26+00:00"}, {"comment_ID": "l0zegcp", "comment_Body": "I'm passionate about teaching!", "comment_Score": 1, "comment_Author": "vladproex", "comment_Link_id": "t3_1carssa", "Create Date": "2024-04-24 01:47:45+00:00"}, {"comment_ID": "l0zd9xf", "comment_Body": "Well, for me all the time. I mean you're a consistent contributor on here who typically offers solid ideas and solutions. I put a timer on my reddit app. If I wanna blow through it all at 6am when I wake up, not at all, or slowly through the day. When it's done it's done\n\nHow did you get good/experience at system/architect design. I feel like I'd be interested in Data Architecture down the line. That's awesome your company provides that opportunity. Just started a new role yesterday and I'm really excited about the different learning opportunities. Gonna be learning Foundry over the next month or so. \n\nThat sounds like you've struck a great balance and found an awesome opportunity. Atm taking a break from practicing till next month. Past 9 months were brutal. But I definitely feel like I wanna improve in some aspects. I definitely prioritize work-life balance and part of what has me excited about my new role. However, I know I also wanna make a lot more money than I currently do. But not at the cost of my life in that I'm making all this money to say I'm making all this money. But I don't get to experience the benefits of any of the money", "comment_Score": 1, "comment_Author": "El_Cato_Crande", "comment_Link_id": "t3_1c5ut6l", "Create Date": "2024-04-24 01:39:55+00:00"}, {"comment_ID": "l0zb36l", "comment_Body": "Single dwh is crazy for you to manage. Maybe single dwh per business unit, so you can scale slowly depending on business expansion.", "comment_Score": 1, "comment_Author": "Jealous-Bat-7812", "comment_Link_id": "t3_1cbkotm", "Create Date": "2024-04-24 01:25:50+00:00"}, {"comment_ID": "l0zavik", "comment_Body": "Yep, that's correct.", "comment_Score": 1, "comment_Author": "j__neo", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 01:24:27+00:00"}, {"comment_ID": "l0zasr5", "comment_Body": "I think they are different use cases, terraform is more geared towards IaC and DAB more for deploying the artifacts running in Databricks. At least that's my understanding.", "comment_Score": 3, "comment_Author": "ecp5", "comment_Link_id": "t3_1cbkvjb", "Create Date": "2024-04-24 01:23:57+00:00"}, {"comment_ID": "l0zas3v", "comment_Body": "I think they meant fundamentals of data engineering. Great high level book. Covers a lot of ground.\n\nhttps://www.thriftbooks.com/w/fundamentals-of-data-engineering-build-robust-end-to-end-data-engineering-solutions/36392086/#edition=64300441&idiq=51914342", "comment_Score": 1, "comment_Author": "gatormig08", "comment_Link_id": "t3_1cb8yh8", "Create Date": "2024-04-24 01:23:50+00:00"}, {"comment_ID": "l0z9mbr", "comment_Body": "Single DW, domain-specific Datamarts", "comment_Score": 1, "comment_Author": "sriracha_cucaracha", "comment_Link_id": "t3_1cbkotm", "Create Date": "2024-04-24 01:16:21+00:00"}, {"comment_ID": "l0z9fg7", "comment_Body": "+1 for shidded 🤣", "comment_Score": 1, "comment_Author": "Ryush806", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 01:15:08+00:00"}, {"comment_ID": "l0z916y", "comment_Body": "I find interviews so useless for experienced hires. \n\nAt this point either be very specific on what you’re looking for, test for that specifically and just do a culture fit.", "comment_Score": 1, "comment_Author": "Extra-Leopard-6300", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 01:12:33+00:00"}, {"comment_ID": "l0z8sq7", "comment_Body": "Wrong depends on the data, doesn’t it?\n\n|Group|Count|\n:--|:--|\n|Item 1|50|\n|Item 2|45|\n|Item 3|45|\n|Item 4|40|\n\nDense Rank will return the wrong answer in this instance, returning top 4 items here as it’ll rank 2 and 3 as the same. WITH TIES with return the right one.", "comment_Score": 0, "comment_Author": "seansafc89", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 01:11:01+00:00"}, {"comment_ID": "l0z86h0", "comment_Body": "Actually with SQL Server Clustered Columnstore (or SQL Datawarehouse) you won't be scanning all rows and columns in your query example.", "comment_Score": 2, "comment_Author": "geoffawilliams", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 01:06:59+00:00"}, {"comment_ID": "l0z77df", "comment_Body": "Job experience and degrees for entry level? That's how interviews used to be, and it seemed to work just fine.", "comment_Score": 1, "comment_Author": "David_Owens", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 01:00:36+00:00"}, {"comment_ID": "l0z5qgj", "comment_Body": "It does, but I guess you choose the strategy that suits your personality and proves successful.  Could be I’m more intuitive to this type of conversation.", "comment_Score": 2, "comment_Author": "ShrekOne2024", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 00:51:05+00:00"}, {"comment_ID": "l0z5km0", "comment_Body": "Having a common dw is the way to go. You want consistency, especially with the catalog or metadata. I vote for glue catalog..it's essentially hive catalog, so nothing fancy. What type of dw we talking here?", "comment_Score": 2, "comment_Author": "Foodwithfloyd", "comment_Link_id": "t3_1cbkotm", "Create Date": "2024-04-24 00:50:02+00:00"}, {"comment_ID": "l0z5823", "comment_Body": "Realtime Streaming is harder, more expensive & 99% of the time not needed by business. Even if you ingest in real time, that data alone is usually useless & has to be joined, transformed & aggregated with other datasets before it can be used by businesss and that post processing can easily add several minutes to the pipeline in which you can do 5 to 10 min batches instead and still deliver same experience but at a much lower cost.\n\nUnless your business users are staring at the screen to act on the changes immediately, go for regular or micro batch instead.", "comment_Score": 1, "comment_Author": "Mr_Nickster_", "comment_Link_id": "t3_1cb8yh8", "Create Date": "2024-04-24 00:47:45+00:00"}, {"comment_ID": "l0z53sw", "comment_Body": "Have you contacted support? Previous employer had an API key, no issues getting ad data. We're were fairly small so I'd imagine you have to ask nicely but it's doable", "comment_Score": 1, "comment_Author": "Foodwithfloyd", "comment_Link_id": "t3_1cbgwfr", "Create Date": "2024-04-24 00:46:59+00:00"}, {"comment_ID": "l0z4t0t", "comment_Body": "Please see our rules about this topic in the sidebar.", "comment_Score": 1, "comment_Author": "dataengineering-ModTeam", "comment_Link_id": "t3_1cbjkwe", "Create Date": "2024-04-24 00:45:02+00:00"}, {"comment_ID": "l0z4svh", "comment_Body": "This is exactly me and why i struggled with exams in school. I could answer questions when teacher called on me, but couldn’t recite things in exams. I’m so worried about technical interviews", "comment_Score": 1, "comment_Author": "jinbe-san", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-24 00:45:01+00:00"}, {"comment_ID": "l0z3yfx", "comment_Body": "The requirements + the existing infrastructure. I only include the former in case the existing infra treats everything as a stream anyway (kappa architecture).", "comment_Score": 1, "comment_Author": "Omeazyy", "comment_Link_id": "t3_1cb8yh8", "Create Date": "2024-04-24 00:39:35+00:00"}, {"comment_ID": "l0z3unp", "comment_Body": "FWIW, anything below 3NF, with no enforcement of constraints, is not considered data engineering. \n\n2NF became outdated for professional use in the mid-late 80’s.", "comment_Score": 1, "comment_Author": "SirGreybush", "comment_Link_id": "t3_1cb573f", "Create Date": "2024-04-24 00:38:55+00:00"}, {"comment_ID": "l0z39hk", "comment_Body": "Same as any other skills: practice, practice & practice.  Then rinse and repeat ;)", "comment_Score": 1, "comment_Author": "dev_lvl80", "comment_Link_id": "t3_1carssa", "Create Date": "2024-04-24 00:35:05+00:00"}, {"comment_ID": "l0z2oap", "comment_Body": ">I also recommend reading the Introduction to data engineering book.\n\nCould you pls share the full title or identifier of the book? Google doesn't match anything specific for \"introduction to data engineering\" - returns a bunch of different vendor tutorial books instead.", "comment_Score": 2, "comment_Author": "robben1234", "comment_Link_id": "t3_1cb8yh8", "Create Date": "2024-04-24 00:31:11+00:00"}, {"comment_ID": "l0z11m6", "comment_Body": "This table seems to be in the first normal form (1NF) because it contains atomic values in each cell, meaning each cell holds a single value. However, it doesn't seem to be in the second normal form (2NF) because there are partial dependencies where non-key attributes depend on part of the primary key", "comment_Score": 1, "comment_Author": "fella7ena", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-24 00:20:33+00:00"}, {"comment_ID": "l0z064k", "comment_Body": "You sound like if stack overflow was a person", "comment_Score": 1, "comment_Author": "Busy_Town1338", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-24 00:14:53+00:00"}, {"comment_ID": "l0yzbfz", "comment_Body": "i could have question for u, u could help me, thanks you.", "comment_Score": 0, "comment_Author": "TrainerLongjumping17", "comment_Link_id": "t3_1cavw37", "Create Date": "2024-04-24 00:09:21+00:00"}, {"comment_ID": "l0ywwvh", "comment_Body": "Why not just use a viz lib built on top of your language I.e. Python + plotly\nOr use front end viz tool like d3.js if you’re going to go code route for analytics?", "comment_Score": 1, "comment_Author": "SignificantWords", "comment_Link_id": "t3_1cb3zbp", "Create Date": "2024-04-23 23:53:38+00:00"}, {"comment_ID": "l0yw568", "comment_Body": "The fact that you aren't modelling into facts and dims doesn't really mean anything in terms of your question.  It's a call it what you want and it has little actual value (outside getting a job at Amazon down the line).\n\nA data lake refers to store both the raw (unstructured and structured) and modelled data in one place. You go there for all your needs.\n\nA data warehouse is the full concept where the source, prep/staging and finalized data models are all stored in one place.  For me - this is primarily related to relational modelling whereas the data lake is both.\n\nA data mart is the holistic term for all data objects (and sometimes hardware + software) related to one line of business.  Like here is the data mart for finance and here it is for marketing.", "comment_Score": 1, "comment_Author": "Separate-Cycle6693", "comment_Link_id": "t3_1cb5h8y", "Create Date": "2024-04-23 23:48:39+00:00"}, {"comment_ID": "l0yup94", "comment_Body": "There's two considerations here.\n\nFirst, what type of queries are you running against your data? If they are analytical queries (e.g. group by, window functions), then using a data processing system that is optimized for those type of query patterns would be more cost effective. SQL Server is a transactional processing system (OLTP) designed for fast data inserts and data updates (CRUD operations), whereas systems like Databricks or Synapse is an OLAP system that supports data partition pruning and data storage using columar-oriented format.\n\nRunning a `select sum(total_sale), country as sales group by country where order_date = '2024-01-01'` can be a very expensive query to run on a transactional database table as it requires you to scan all rows and all columns to get the answer. Whereas on an OLAP system, the `where` clause is a filter predicate that would result in data partition pruning, so only relevant rows will be scanned. And also because of the columnar file format, only selected columns will be scanned and used to provide the answer.\n\nSecond, a lakehouse architecture is designed for you to plug in your own compute to query the dataset files stored on a cloud filesystem (e.g. s3 bucket, data lake filesystem). So if you wanted to, you could have your machine learning workloads running on CPU or GPU optimized compute directly read files that are stored in the data lake filesystem as delta/iceberg/hudi/parquet file formats. On the flip side, if all your data is stored on a database, then for a machine learning workload to query the data, it involves spinning up two computes to query the data. Compute #1 would be your database engine (e.g. SQL server compute) to read data files and send the data back over the network, and Compute #2 (CPU or GPU optimized compute) for the machine learning workload to receive the data and then do further ML processing or prediction to the data. A lakehouse architecture can help to reduce the amount of compute resources required to perform a task.\n\nIn your situation, because you don't have a dedicated data engineer, I'd say to stick with what you know as that gets you to your desired outcomes. Your existing pattern works and your data volumes appear to be relatively small, and therefore you should only consider switching to a new architecture if:\n\n* Your data volumes are increasing at a rapid rate of growth (e.g. data volumes increasing by 10% per month).\n* You're not satisfied with the time it takes to process data (e.g. your queries take hours to run, and you want them completed in seconds or minutes).\n* Your company's desire for data insights is growing at a rapid rate (e.g. more data analysts or data scientists are being hired to build more data analytics and machine learning use-cases on top of the data).", "comment_Score": 1, "comment_Author": "j__neo", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-23 23:39:12+00:00"}, {"comment_ID": "l0yu7n0", "comment_Body": "If the org follows standardization of performance using OKRs, KPIs or just general goals then you are evaluated against what you committed to.  A lot of it is to ensure that your team is thriving and delivering value for the company.  As part of that - it's a lot of strategic thinking and putting that into actionable plans that higher ups can say \"how about we cut that budget by 20% instead of 15%?\" \n\nMy Q1 goals were things like: \n\n- Address teams technical gap for accounting and finance support (I hired a mid-level analyst who support those verticals now). \n\n- Develop budget and financial forward-looking plan for team and organization. My Q2 goal is to cut $10k in spend from something unproductive. \n\n- Roll out new data products to end users by a certain date. Side goal - train and ensure utilization rate hits 70% of users log in weekly.", "comment_Score": 4, "comment_Author": "Separate-Cycle6693", "comment_Link_id": "t3_1cbhw1f", "Create Date": "2024-04-23 23:36:00+00:00"}, {"comment_ID": "l0yu3y1", "comment_Body": "These files are not too big for excel? Load them via powerquery then.", "comment_Score": 1, "comment_Author": "Zyklon00", "comment_Link_id": "t3_1cbcfsv", "Create Date": "2024-04-23 23:35:19+00:00"}, {"comment_ID": "l0yttrw", "comment_Body": "> FETCH FIRST 3 ROWS WITH TIES\n\nThis is different from dense rank and will return the wrong answer.", "comment_Score": 1, "comment_Author": "slowpush", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-23 23:33:27+00:00"}, {"comment_ID": "l0ytk4y", "comment_Body": "Yeah in JD they put all modern tools even if they are not using any.\n\nAlso, having a tool there doesn't mean you need to know about that specific tool, just in general orchestration and other similar tools.", "comment_Score": 1, "comment_Author": "mjfnd", "comment_Link_id": "t3_1c8w7qx", "Create Date": "2024-04-23 23:31:42+00:00"}, {"comment_ID": "l0ypq43", "comment_Body": "In short, MS Access.", "comment_Score": 2, "comment_Author": "Idiot_LevMyskin", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-23 23:06:36+00:00"}, {"comment_ID": "l0yp6fy", "comment_Body": "The mantra\n\n1nf The key\n\n2nf The whole key\n\n3nf Nothing but the key\n\nLook it up, it is much easier by following the above", "comment_Score": 2, "comment_Author": "Mukimpo_baka", "comment_Link_id": "t3_1cb573s", "Create Date": "2024-04-23 23:03:02+00:00"}, {"comment_ID": "l0yondw", "comment_Body": "> it won't be tied to Fabric because then you're essentially mandating that customers upgrade their licensing to Fabric.. if they do that I will definitely have a good chuckle\n\nwell, they've done it lol", "comment_Score": 1, "comment_Author": "probablymilhouse", "comment_Link_id": "t3_17vxmth", "Create Date": "2024-04-23 22:59:37+00:00"}, {"comment_ID": "l0yojsc", "comment_Body": "Why is 'Dude who hangs around data subreddits plugging their own niche startup based on a tool nobody asked for' so damn common? Is there like a school or something churning you out?", "comment_Score": 3, "comment_Author": "fauxmosexual", "comment_Link_id": "t3_1cb7mqe", "Create Date": "2024-04-23 22:58:57+00:00"}, {"comment_ID": "l0ynym7", "comment_Body": "I’ve just been using ChatGPT it s right most of the time", "comment_Score": 1, "comment_Author": "snarleyWhisper", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-23 22:55:11+00:00"}, {"comment_ID": "l0yl3qt", "comment_Body": "That goes both ways buddy. Anyone can say what failed and succeeded in a project they are in but not actually be involved.", "comment_Score": 3, "comment_Author": "tomoeshikihiro", "comment_Link_id": "t3_1cb2ym3", "Create Date": "2024-04-23 22:36:57+00:00"}]